app/controllers/students_controller.rb

    def create
        @student = Student.new(params.require(:student).permit(:first_name, :last_name))
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "matt"], ["last_name", "mcpear"], ["created_at", "2022-06-28 06:14:42.981041"], ["updated_at", "2022-06-28 06:14:42.981041"]]

    def update
        @student = Student.find(params[:id])
        @student.update(params.require(:student).permit(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "hfkgjkjkjh"], ["updated_at", "2022-06-28 06:25:36.075620"], ["id", 7]]